# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Rafael\Documents\PSoC Creator\SD Card\SDCard_Demo.cydsn\SDCard_Demo.cyprj
# Date: Mon, 07 May 2018 04:34:48 GMT
#set_units -time ns
create_clock -name {SDCard_SD_Clock(FFB)} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {SDCard_SD_Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 1501 3001} [list]


# Component constraints for C:\Users\Rafael\Documents\PSoC Creator\SD Card\SDCard_Demo.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Rafael\Documents\PSoC Creator\SD Card\SDCard_Demo.cydsn\SDCard_Demo.cyprj
# Date: Mon, 07 May 2018 04:34:43 GMT
